experiments/d3000-pkvm-apps/results/d3000-apps-always-20260717-093223/pair-1/protected/redis-r1-steady/rep-03/memtier.txt
4         Threads
25        Connections per thread
300       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets         8545.62          ---          ---         0.70709         0.73500         0.81500         1.46300         1.52700      8894.80 
Gets        85455.03     85455.03         0.00         0.70221         0.72700         0.79900         1.45500         1.52700     88529.51 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals      94000.65     85455.03         0.00         0.70265         0.72700         0.79900         1.45500         1.52700     97424.31 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.335        5.000
SET       0.567       10.000
SET       0.679       15.000
SET       0.695       20.000
SET       0.703       25.000
SET       0.711       30.000
SET       0.719       35.000
SET       0.719       40.000
SET       0.727       45.000
SET       0.735       50.000
SET       0.735       52.500
SET       0.735       55.000
SET       0.743       57.500
SET       0.743       60.000
SET       0.743       62.500
SET       0.743       65.000
SET       0.751       67.500
SET       0.751       70.000
SET       0.751       72.500
SET       0.751       75.000
SET       0.751       76.250
SET       0.751       77.500
SET       0.759       78.750
SET       0.759       80.000
SET       0.759       81.250
SET       0.759       82.500
SET       0.759       83.750
SET       0.759       85.000
SET       0.759       86.250
SET       0.767       87.500
SET       0.767       88.125
SET       0.767       88.750
SET       0.767       89.375
SET       0.767       90.000
SET       0.767       90.625
SET       0.767       91.250
SET       0.775       91.875
SET       0.775       92.500
SET       0.775       93.125
SET       0.783       93.750
SET       0.783       94.062
SET       0.791       94.375
SET       0.799       94.688
SET       0.815       95.000
SET       0.823       95.312
SET       0.839       95.625
SET       0.863       95.938
SET       0.887       96.250
SET       0.919       96.562
SET       0.951       96.875
SET       0.967       97.031
SET       0.983       97.188
SET       1.007       97.344
SET       1.023       97.500
SET       1.079       97.656
SET       1.223       97.812
SET       1.335       97.969
SET       1.367       98.125
SET       1.391       98.281
SET       1.407       98.438
SET       1.415       98.516
SET       1.423       98.594
SET       1.431       98.672
SET       1.439       98.750
SET       1.447       98.828
SET       1.455       98.906
SET       1.463       98.984
SET       1.463       99.062
SET       1.471       99.141
SET       1.479       99.219
SET       1.479       99.258
SET       1.479       99.297
SET       1.487       99.336
SET       1.487       99.375
SET       1.487       99.414
SET       1.487       99.453
SET       1.495       99.492
SET       1.495       99.531
SET       1.495       99.570
SET       1.503       99.609
SET       1.503       99.629
SET       1.503       99.648
SET       1.503       99.668
SET       1.503       99.688
SET       1.503       99.707
SET       1.511       99.727
SET       1.511       99.746
SET       1.511       99.766
SET       1.511       99.785
SET       1.519       99.805
SET       1.519       99.814
SET       1.519       99.824
SET       1.519       99.834
SET       1.519       99.844
SET       1.519       99.854
SET       1.519       99.863
SET       1.527       99.873
SET       1.527       99.883
SET       1.527       99.893
SET       1.527       99.902
SET       1.527       99.907
SET       1.535       99.912
SET       1.535       99.917
SET       1.535       99.922
SET       1.535       99.927
SET       1.543       99.932
SET       1.543       99.937
SET       1.543       99.941
SET       1.551       99.946
SET       1.551       99.951
SET       1.559       99.954
SET       1.559       99.956
SET       1.559       99.958
SET       1.567       99.961
SET       1.567       99.963
SET       1.575       99.966
SET       1.575       99.968
SET       1.583       99.971
SET       1.591       99.973
SET       1.599       99.976
SET       1.599       99.977
SET       1.599       99.978
SET       1.607       99.979
SET       1.607       99.980
SET       1.615       99.982
SET       1.615       99.983
SET       1.623       99.984
SET       1.623       99.985
SET       1.631       99.987
SET       1.631       99.988
SET       1.639       99.988
SET       1.639       99.989
SET       1.639       99.990
SET       1.647       99.990
SET       1.655       99.991
SET       1.655       99.991
SET       1.663       99.992
SET       1.671       99.993
SET       1.687       99.993
SET       1.711       99.994
SET       1.743       99.994
SET       1.775       99.995
SET       1.799       99.995
SET       1.839       99.995
SET       1.887       99.995
SET       1.991       99.996
SET       2.031       99.996
SET       2.111       99.996
SET       2.127       99.997
SET       2.159       99.997
SET       2.191       99.997
SET       2.191       99.997
SET       2.207       99.997
SET       2.239       99.998
SET       2.255       99.998
SET       2.255       99.998
SET       2.271       99.998
SET       2.351       99.998
SET       2.383       99.998
SET       2.479       99.998
SET       2.911       99.999
SET       4.767       99.999
SET       4.767       99.999
SET       4.767       99.999
[...]
SET       4.799       99.999
SET       4.799       99.999
SET       4.799       99.999
[...]
SET       4.799      100.000
SET       4.799      100.000
SET       4.799      100.000
SET       4.831      100.000
SET       4.831      100.000
---
GET       0.023        0.000
GET       0.335        5.000
GET       0.567       10.000
GET       0.671       15.000
GET       0.687       20.000
GET       0.695       25.000
GET       0.703       30.000
GET       0.711       35.000
GET       0.719       40.000
GET       0.727       45.000
GET       0.727       50.000
GET       0.735       52.500
GET       0.735       55.000
GET       0.735       57.500
GET       0.735       60.000
GET       0.743       62.500
GET       0.743       65.000
GET       0.743       67.500
GET       0.743       70.000
GET       0.743       72.500
GET       0.751       75.000
GET       0.751       76.250
GET       0.751       77.500
GET       0.751       78.750
GET       0.751       80.000
GET       0.751       81.250
GET       0.751       82.500
GET       0.751       83.750
GET       0.759       85.000
GET       0.759       86.250
GET       0.759       87.500
GET       0.759       88.125
GET       0.759       88.750
GET       0.759       89.375
GET       0.759       90.000
GET       0.767       90.625
GET       0.767       91.250
GET       0.767       91.875
GET       0.767       92.500
GET       0.775       93.125
GET       0.775       93.750
GET       0.775       94.062
GET       0.783       94.375
GET       0.791       94.688
GET       0.799       95.000
GET       0.807       95.312
GET       0.823       95.625
GET       0.839       95.938
GET       0.855       96.250
GET       0.879       96.562
GET       0.919       96.875
GET       0.935       97.031
GET       0.951       97.188
GET       0.975       97.344
GET       0.991       97.500
GET       1.023       97.656
GET       1.103       97.812
GET       1.255       97.969
GET       1.343       98.125
GET       1.375       98.281
GET       1.391       98.438
GET       1.407       98.516
GET       1.415       98.594
GET       1.423       98.672
GET       1.431       98.750
GET       1.439       98.828
GET       1.447       98.906
GET       1.455       98.984
GET       1.463       99.062
GET       1.463       99.141
GET       1.471       99.219
GET       1.479       99.258
GET       1.479       99.297
GET       1.479       99.336
GET       1.487       99.375
GET       1.487       99.414
GET       1.487       99.453
GET       1.487       99.492
GET       1.495       99.531
GET       1.495       99.570
GET       1.495       99.609
GET       1.503       99.629
GET       1.503       99.648
GET       1.503       99.668
GET       1.503       99.688
GET       1.503       99.707
GET       1.503       99.727
GET       1.511       99.746
GET       1.511       99.766
GET       1.511       99.785
GET       1.511       99.805
GET       1.511       99.814
GET       1.519       99.824
GET       1.519       99.834
GET       1.519       99.844
GET       1.519       99.854
GET       1.519       99.863
GET       1.519       99.873
GET       1.527       99.883
GET       1.527       99.893
GET       1.527       99.902
GET       1.527       99.907
GET       1.527       99.912
GET       1.527       99.917
GET       1.535       99.922
GET       1.535       99.927
GET       1.535       99.932
GET       1.535       99.937
GET       1.543       99.941
GET       1.543       99.946
GET       1.551       99.951
GET       1.551       99.954
GET       1.551       99.956
GET       1.551       99.958
GET       1.559       99.961
GET       1.559       99.963
GET       1.567       99.966
GET       1.567       99.968
GET       1.575       99.971
GET       1.575       99.973
GET       1.583       99.976
GET       1.591       99.977
GET       1.591       99.978
GET       1.599       99.979
GET       1.599       99.980
GET       1.607       99.982
GET       1.607       99.983
GET       1.615       99.984
GET       1.615       99.985
GET       1.623       99.987
GET       1.623       99.988
GET       1.631       99.988
GET       1.631       99.989
GET       1.631       99.990
GET       1.639       99.990
GET       1.639       99.991
GET       1.647       99.991
GET       1.655       99.992
GET       1.663       99.993
GET       1.671       99.993
GET       1.687       99.994
GET       1.703       99.994
GET       1.727       99.995
GET       1.767       99.995
GET       1.823       99.995
GET       1.895       99.995
GET       1.959       99.996
GET       2.007       99.996
GET       2.063       99.996
GET       2.127       99.997
GET       2.175       99.997
GET       2.207       99.997
GET       2.223       99.997
GET       2.239       99.997
GET       2.271       99.998
GET       2.303       99.998
GET       2.351       99.998
GET       2.463       99.998
GET       2.479       99.998
GET       2.719       99.998
GET       2.863       99.998
GET       2.943       99.999
GET       3.935       99.999
GET       4.047       99.999
GET       4.127       99.999
GET       4.223       99.999
GET       4.287       99.999
GET       4.767       99.999
GET       4.767       99.999
GET       4.767       99.999
[...]
GET       4.799       99.999
GET       4.799       99.999
GET       4.799       99.999
[...]
GET       4.831      100.000
GET       4.831      100.000
GET       5.375      100.000
GET       5.535      100.000
GET       5.631      100.000
GET       5.695      100.000
GET       5.695      100.000
GET       5.727      100.000
GET       5.759      100.000
GET       5.759      100.000
GET       5.791      100.000
GET       5.823      100.000
GET       5.855      100.000
GET       5.855      100.000
GET       5.855      100.000
[...]
GET       5.887      100.000
GET       5.887      100.000
GET       5.887      100.000
[...]
GET       5.919      100.000
GET       5.919      100.000
GET       5.919      100.000
GET       5.951      100.000
GET       5.951      100.000
GET       5.951      100.000
[...]
GET       5.983      100.000
GET       5.983      100.000
GET       5.983      100.000
[...]
GET       6.015      100.000
GET       6.015      100.000
GET       6.015      100.000
[...]
GET       6.047      100.000
GET       6.047      100.000
GET       6.047      100.000
[...]
GET       6.463      100.000
GET       6.463      100.000
---
WAIT      0.000      100.000